app/controllers/datasheets_controller.rb

  def index
    #sort th table - sort_column and sort_direction are defined below in private
    @datasheets = Datasheet.order(sort_column + " " + sort_direction)
---
SELECT "datasheets".* FROM "datasheets" ORDER BY seq_number seq_number

  def create
    @datasheet = Datasheet.new(datasheet_params)

    respond_to do |format|
      if @datasheet.save
---
INSERT INTO "datasheets" ("seq_version", "category", "seq_title", "pub_date", "seq_update", "seq_original_list", "active", "drop_date", "drop_reason", "pes_version", "pes_listed", "needs_approval", "has_approval", "approval_info", "course_note", "extra_note", "extra_boolean", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @datasheet.update(datasheet_params)
---
UPDATE "datasheets" SET "seq_version" = ?, "category" = ?, "seq_title" = ?, "active" = ?, "drop_reason" = ?, "pes_listed" = ?, "needs_approval" = ?, "has_approval" = ?, "approval_info" = ?, "course_note" = ?, "extra_note" = ?, "extra_boolean" = ?, "pub_date" = ?, "seq_update" = ?, "seq_original_list" = ?, "drop_date" = ?, "updated_at" = ? WHERE "datasheets"."id" = ?

  def destroy
    @datasheet.destroy
---
DELETE FROM "datasheets" WHERE "datasheets"."id" = ?  [["id", 4]]

    def set_datasheet
      @datasheet = Datasheet.find(params[:id])
---
SELECT  "datasheets".* FROM "datasheets" WHERE "datasheets"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]