app/controllers/updatesheets_controller.rb

SELECT "updatesheets".* FROM "updatesheets" ORDER BY date_received desc
---
  def index
    #Sortable column headers
    @updatesheets = Updatesheet.order(sort_column + " " + sort_direction)

INSERT INTO "updatesheets" ("pes_number", "pes_version", "date_received", "update_course", "new_course", "note_approval", "text_complete", "exam_complete", "course_listed", "date_listed", "role", "rolep", "irs_number", "proofed", "proofed_note", "datasheet_id", "created_at", "updated_at", "seq_version") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @updatesheet = Updatesheet.new(updatesheet_params)

    respond_to do |format|
      if @updatesheet.save

UPDATE "updatesheets" SET "text_complete" = ?, "exam_complete" = ?, "course_listed" = ?, "hold" = ?, "date_listed" = ?, "updated_at" = ? WHERE "updatesheets"."id" = ?  [["text_complete", "t"], ["exam_complete", "t"], ["course_listed", "t"], ["hold", "f"], ["date_listed", "2018-04-29"], ["updated_at", "2018-04-30 11:03:15.675878"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @updatesheet.update(updatesheet_params)

DELETE FROM "updatesheets" WHERE "updatesheets"."id" = ?  [["id", 4]]
---
  def destroy
    @updatesheet.destroy

SELECT  "updatesheets".* FROM "updatesheets" WHERE "updatesheets"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_updatesheet
      @updatesheet = Updatesheet.find(params[:id])